var test = require('./index.js');
var assert = require('assert');

describe('输入数据',()=>{
    it('第一组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三`)
        },Error);
    });
    it('第二组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一
            2015级硕士生：李四
            2016级硕士生：刘一
            2017级本科生：刘六`)
        },Error);
    });
    it('第二组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一
            2015级硕士生：李四
            2016级硕士生：刘一
            2017级本科生：刘六`)
        },Error);
    });
    it('第三组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一、王二、吴五
            2015级硕士生：李四、王五、许六
            2016级硕士生：刘一、李二、李三
            2017级本科生：刘六、琪七、司四`)
        },Error);
    });
    it('第四组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一、王二、吴五
            2015级硕士生：李四、王五、许六
            2016级硕士生：刘一、李二、李三
            2017级本科生：刘六、琪七、司四
            
            刘六：JAVA、数学建模
            
            李二：字节跳动、京东云`)
        },Error);
    });
    it('第五组数据',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一、王二、吴五
            2015级硕士生：李四、王五、许六
            2016级硕士生：刘一、李二、李三
            2017级本科生：刘六、琪七、司四
            
            刘六：JAVA、数学建模
            
            李二：字节跳动、京东云
            
            
            导师：张森
            2016级博士生：天一、王二、吴无
            2015级硕士生：李四、王误、许六
            2016级硕士生：刘亦、李尔、李三
            2017级本科生：刘陆、琪七、司四
            
            刘陆：Python、数学建模
            
            李尔：字节跳动、阿里云`)
        },Error);
    });
});

describe('输入数据不符合格式',()=>{
    it('数据为空',()=>{
        assert.throws(()=>{
            test.show("")
        },Error);
    });
    it('树间换行不符',()=>{
        assert.throws(()=>{
            test.show(`导师：张三
            2016级博士生：天一、王二、吴五
            2015级硕士生：李四、王五、许六
            2016级硕士生：刘一、李二、李三
            2017级本科生：刘六、琪七、司四
            
            刘六：JAVA、数学建模
            
            李二：字节跳动、京东云
            
            导师：张森
            2016级博士生：天一、王二、吴无
            2015级硕士生：李四、王误、许六
            2016级硕士生：刘亦、李尔、李三
            2017级本科生：刘陆、琪七、司四
            
            刘陆：Python、数学建模
            
            李尔：字节跳动、阿里云`)
        },Error);
    });
});

